import 'package:flutter/material.dart';

// подключение к БД
void connectToDB() {

}

String jsonString = '''
  {
      "quests": [
        {
          "quest_id": 1,
          "status": 0,
          "found_exhibits": [],
          "completion_time": null
        },
        {
          "quest_id": 2,
          "status": 1,
          "found_exhibits": [
            1,
            3
          ],
          "completion_time": null
          },
        {
          "quest_id": 3,
          "status": 2,
          "found_exhibits": [],
          "completion_time": 15
        }
      ]
  }''';

// получение информации о квестах с сервера
Map<String, dynamic> getQuestsInfo() {
  Map<String, dynamic> result =
        {
          'Одежда' : {
            "quest_id": 1,
            'description': 'Традиционная одежда, вышивка, укращения и ткачество',
            'stat': '0',
            'img': 'lib/img/'+'background_image_1.jpg',
            // id экспонатов
            'exhibits' : {
                  // картинка экспонтата, информация про него, первый элемент - флаг (определяем вопрос или метка)
                  "quest_1.png": ["q", "Вопрос для первого экспоната (1)?", "1"],
                  "quest_2.png": ["q", "Вопрос для первого экспоната (2)?", "2"],
                  "quest_3.png": ["q", "Вопрос для первого экспоната (3)?", "3"],
                  "quest_4.png": ["q", "Вопрос для первого экспоната (4)?", "4"],
                  "quest_5.png": ["q", "Вопрос для первого экспоната (5)?", "5"],
                  "quest_6.png": ["q", "Вопрос для первого экспоната (6)?", "6"],
            },
          },

          'Изобретения' : {
            "quest_id": 2,
            'description': 'Лодки, инструменты, украшения из меди и многое другое',
            'stat': '1',
            'img': 'lib/img/' + 'background_image_2.jpg',
            // id экспонатов
            'exhibits' : {
              // картинка экспонтата, информация про него, первый элемент - флаг (определяем вопрос или метка)
              "quest_1.png": ["q", "Какого века макет?", "18"],
              "quest_2.png": ["q", "Какого века макет?", "18"],
              "quest_3.png": ["q", "Какого века макет?", "18"],
              "quest_4.png": ["q", "Какого века макет?", "18"],
              "quest_5.png": ["q", "Какого века макет?", "18"],
              "quest_6.png": ["q", "Какого века макет?", "18"],
            },
          },

          'Национальные блюда' : {
            "quest_id": 3,
            'description': 'Традиционная одежда, вышивка, украшения и ткачество',
            'stat': '2',
            'img': 'lib/img/' + 'background_image_3.jpg',
            // id экспонатов
            'exhibits' : {
              // картинка экспонтата, информация про него, первый элемент - флаг (определяем вопрос или метка)
              "quest_1.png": ["q", "Какого века макет?", "18"],
              "quest_2.png": ["q", "Какого века макет?", "18"],
              "quest_3.png": ["q", "Какого века макет?", "18"],
              "quest_4.png": ["q", "Какого века макет?", "18"],
              "quest_5.png": ["q", "Какого века макет?", "18"],
              "quest_6.png": ["q", "Какого века макет?", "18"],
            },
          },
        };

  return result;
}
